{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Billing inquiry",
    "1": "Cancellation request",
    "2": "Product inquiry",
    "3": "Refund request",
    "4": "Technical issue"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Billing inquiry": 0,
    "Cancellation request": 1,
    "Product inquiry": 2,
    "Refund request": 3,
    "Technical issue": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "vocab_size": 30522
}
